; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v3 - type_1 ?v2 - type_3)
 	      (pred_3 ?v4 - object ?v2 - type_3)
	      (pred_1 ?v3 - type_1 ?v1 - type_2)
	      (pred_4 ?v3 - type_1 ?v4 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v8 ?v7 - type_3)
       :precondition (and  (pred_2 ?v3 ?v8))
       :effect (and  (pred_2 ?v3 ?v7)
		     (not (pred_2 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v6) (pred_2 ?v3 ?v6) (pred_1 ?v3 ?v1))
       :effect (and (pred_4 ?v3 ?v5 ?v1)
		    (not (pred_3 ?v5 ?v6)) 
		    (not (pred_1 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v5 ?v1) (pred_2 ?v3 ?v6))
       :effect (and (pred_3 ?v5 ?v6)
		    (pred_1 ?v3 ?v1)
		    (not (pred_4 ?v3 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_12 - type_1
obj_02 obj_11 obj_09 obj_06 - type_2
obj_10 obj_05 obj_13 obj_04 - type_3
obj_07 obj_08 obj_03 - object)
(:init
(pred_2 obj_01 obj_13)
(pred_1 obj_01 obj_02)
(pred_1 obj_01 obj_11)
(pred_2 obj_12 obj_05)
(pred_1 obj_12 obj_09)
(pred_1 obj_12 obj_06)
(pred_3 obj_07 obj_04)
(pred_3 obj_08 obj_05)
(pred_3 obj_03 obj_05)
)
(:goal
(and
(pred_3 obj_07 obj_10)
(pred_3 obj_08 obj_10)
(pred_3 obj_03 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_01 obj_10) (pred_2 obj_12 obj_10))))
  )
)
)

; plan
1. (op_3 obj_01 obj_13 obj_05)
   deleted: (pred_2 obj_01 obj_13)
   added: (pred_2 obj_01 obj_05)
   goals met: 0 of 3
2. (op_2 obj_12 obj_03 obj_05 obj_06)
   deleted: (pred_3 obj_03 obj_05) (pred_1 obj_12 obj_06)
   added: (pred_4 obj_12 obj_03 obj_06)
   goals met: 0 of 3
3. (op_2 obj_12 obj_08 obj_05 obj_09)
   deleted: (pred_3 obj_08 obj_05) (pred_1 obj_12 obj_09)
   added: (pred_4 obj_12 obj_08 obj_09)
   goals met: 0 of 3
4. (op_3 obj_01 obj_05 obj_04)
   deleted: (pred_2 obj_01 obj_05)
   added: (pred_2 obj_01 obj_04)
   goals met: 0 of 3
5. (op_3 obj_12 obj_05 obj_10)
   deleted: (pred_2 obj_12 obj_05)
   added: (pred_2 obj_12 obj_10)
   goals met: 0 of 3
6. (op_2 obj_01 obj_07 obj_04 obj_11)
   deleted: (pred_3 obj_07 obj_04) (pred_1 obj_01 obj_11)
   added: (pred_4 obj_01 obj_07 obj_11)
   goals met: 0 of 3
7. (op_1 obj_12 obj_03 obj_10 obj_06)
   deleted: (pred_4 obj_12 obj_03 obj_06)
   added: (pred_3 obj_03 obj_10) (pred_1 obj_12 obj_06)
   goals met: 1 of 3
8. (op_1 obj_12 obj_08 obj_10 obj_09)
   deleted: (pred_4 obj_12 obj_08 obj_09)
   added: (pred_3 obj_08 obj_10) (pred_1 obj_12 obj_09)
   goals met: 2 of 3
9. (op_3 obj_12 obj_10 obj_05)
   deleted: (pred_2 obj_12 obj_10)
   added: (pred_2 obj_12 obj_05)
   goals met: 2 of 3
10. (op_3 obj_01 obj_04 obj_10)
   deleted: (pred_2 obj_01 obj_04)
   added: (pred_2 obj_01 obj_10)
   goals met: 2 of 3
11. (op_1 obj_01 obj_07 obj_10 obj_11)
   deleted: (pred_4 obj_01 obj_07 obj_11)
   added: (pred_3 obj_07 obj_10) (pred_1 obj_01 obj_11)
   goals met: 3 of 3
